# Используем легковесный официальный образ Python
FROM python:3.11-slim

# Настройки для адекватной работы Python внутри Docker
# Запрещаем создавать .pyc файлы
ENV PYTHONDONTWRITEBYTECODE=1
# Логи пишутся в консоль без буферизации (сразу видим принты)
ENV PYTHONUNBUFFERED=1

# Создаем рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем только файл зависимостей
# (это кэширует слой установки библиотек, чтобы не качать их каждый раз при изменении кода)
COPY requirements.txt .

# Устанавливаем библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код нашего проекта в контейнер
COPY . .